app/Controllers/Statiques.php

    public function afficher($contenu){
        if ( ! is_file(APPPATH.'/Views/statiques/'.$contenu.'.php')){
        throw new \CodeIgniter\Exceptions\PageNotFoundException($contenu);
        }
        //ajouter pour articles
        $model = new M_articles();
        // pagination
        $pager = service("pager");
        // pagination
        $data = ['articles' => $model->orderBy('id_articles', 'DESC')->paginate(6),
                    'pager' => $pager,
                'alaune' => $model->getArticles(),
                ];
---
SELECT *
FROM `articles`
ORDER BY `id_articles` DESC
 LIMIT 6, 6
SELECT COUNT(*) AS `numrows`
FROM `articles`

    public function affConventions($contenu){
        if ( ! is_file(APPPATH.'/Views/statiques/'.$contenu.'.php')){
        throw new \CodeIgniter\Exceptions\PageNotFoundException($contenu);
        }
        //ajouter pour articles
        $model = new M_publications();
        // pagination
        $pager = service("pager");
        // pagination
        $data = ['conventions' => $model->where('categorie','convention')->orderBy('id_publications', 'DESC')->paginate(6),
                    'pager' => $pager,
                ];
---
SELECT *
FROM `publications`
WHERE `categorie` = 'convention'
ORDER BY `id_publications` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `publications`
WHERE `categorie` = 'convention'

    public function affLois($contenu){
        if ( ! is_file(APPPATH.'/Views/statiques/'.$contenu.'.php')){
        throw new \CodeIgniter\Exceptions\PageNotFoundException($contenu);
        }
        //ajouter pour articles
        $model = new M_publications();
        // pagination
        $pager = service("pager");
        // pagination
        $data = ['lois' => $model->where('categorie','lois')->orderBy('id_publications', 'DESC')->paginate(6),
                    'pager' => $pager,
                ];
---
SELECT *
FROM `publications`
WHERE `categorie` = 'lois'
ORDER BY `id_publications` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `publications`
WHERE `categorie` = 'lois'

    public function affLicences($contenu){
        if ( ! is_file(APPPATH.'/Views/statiques/'.$contenu.'.php')){
        throw new \CodeIgniter\Exceptions\PageNotFoundException($contenu);
        }
        //ajouter pour articles
        $model = new M_services();
        // pagination
        $pager = service("pager");
        // pagination
        $data = ['licence' => $model->where('categorie','licence')->orderBy('id_services', 'DESC')->paginate(6),
                    'pager' => $pager,
                ];
---
SELECT *
FROM `services`
WHERE `categorie` = 'licence'
ORDER BY `id_services` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `services`
WHERE `categorie` = 'licence'