app/Models/M_articles.php

    public function getArticles(){

        return $this->select('*')
        ->orderBy('id_articles', 'DESC')->findAll();
---
SELECT *
FROM `articles`
ORDER BY `id_articles` DESC