app/Models/M_newletter.php

INSERT INTO `newletter` (`email`) VALUES ('maz@gamil.com')
---
    public function saveNewletter($data)
    {
        $query = $this->db->table($this->table)->insert($data);